## Pandas Skill Test

1. 데이터프레임을 생성해 봅시다!
- 데이터프레임명 : name_df
- 컬럼명 : 날짜 이름 나이 성별 기수
- 모든 컬럼의 데이터 타입은 object로 입력해 주세요.

In [25]:
import pandas as pd

         날짜   이름  나이  성별 기수
0  20221024  김중헌  29  남자  4
1  20221024  이하림  29  여자  5
2  20221024  조민정  29  여자  5
3  20221024  주채연  29  여자  5

         날짜   이름  나이 성별  기수
0  20221024  김중헌  29  남   4
1  20221024  이하림  29  여   5
2  20221024  조민정  29  여   5
3  20221024  주채연  29  여   5

### 2. 데이터 타입 변경
- name_df 컬럼들의 데이터 타입을 출력하세요.
- 날짜 컬럼의 데이터 타입을 datatime으로 변경하세요.
- 나이 컬럼의 데이터 타입을 int로 변경하세요.

날짜     int64
이름    object
나이    object
성별    object
기수     int64
dtype: object

dtype('int64')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   날짜      4 non-null      int64
 1   이름      4 non-null      object
 2   나이      4 non-null      object
 3   성별      4 non-null      object
 4   기수      4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 288.0+ bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   날짜      4 non-null      datetime64[ns]
 1   이름      4 non-null      object
 2   나이      4 non-null      int32
 3   성별      4 non-null      object
 4   기수      4 non-null      int64
dtypes: datetime64[ns](1), int32(1), int64(1), object(2)
memory usage: 272.0+ bytes

## 3. 컬럼 변경
- 이름 컬럼의 컬럼명을 name으로 바꾸세요.
- 컬럼의 순서를 날짜 name 성별 기수 나이 로 바꾸세요.

                             날짜 name  나이 성별  기수
0 1970-01-01 00:00:00.020221024  김중헌  29  남   4
1 1970-01-01 00:00:00.020221024  이하림  29  여   5
2 1970-01-01 00:00:00.020221024  조민정  29  여   5
3 1970-01-01 00:00:00.020221024  주채연  29  여   5

Index(['날짜', 'name', '나이', '성별', '기수'], dtype='object')

                             날짜 name 성별  기수  나이
0 1970-01-01 00:00:00.020221024  김중헌  남   4  29
1 1970-01-01 00:00:00.020221024  이하림  여   5  29
2 1970-01-01 00:00:00.020221024  조민정  여   5  29
3 1970-01-01 00:00:00.020221024  주채연  여   5  29

## 4. 로우 값 변경
- 남 은 남자로, 여 는 여자로 바꾸세요.

                             날짜 name  성별  기수  나이
0 1970-01-01 00:00:00.020221024  김중헌  남자   4  29
1 1970-01-01 00:00:00.020221024  이하림  여자   5  29
2 1970-01-01 00:00:00.020221024  조민정  여자   5  29
3 1970-01-01 00:00:00.020221024  주채연  여자   5  29